import type { Range } from '../lib/range-util'
import { range } from '../lib/range-util'

export const pxPerSm = 10

export const ranges = (function createRanges(){

    return {
        m: range(100, 250), // граммы
        L: range(30, 60), // см

        a: range(10, 30), // градусы

        r: range(1.5, 3.5) // сантиметры
    }
})()

export const variantToNu: Record<number, number> = {
   	1: 0.00015,
	2: 0.00012,
	3: 0.00011,
	4: 0.00010,
	5: 0.00012,
	6: 0.00016,
	7: 0.00018,
	8: 0.00011,
	9: 0.00018,
	10: 0.00009,
	11: 0.00009,
	12: 0.00019,
	13: 0.00012,
	14: 0.00016,
	15: 0.00018,
	16: 0.00010,
	17: 0.00026,
	18: 0.00014,
	19: 0.00032,
	20: 0.00015,
	21: 0.00010,
	22: 0.00012,
	23: 0.00010,
	24: 0.00021,
	25: 0.00014,
	26: 0.00016,
	27: 0.00013,
	28: 0.00084,
	29: 0.00036,
	30: 0.00034,
}
